PLAYERS = ['ch', 'cx', 'fwk', 'hcd', 'hlk', 'lhy', 'lq', 'lsk', 'lwq', 'mzh', 'pc', 'qfy']
RANGES = {
    'range3': range(1, 4),
    'range4': range(1, 5),
    'range5': range(1, 6),
    'range10': range(1, 11),
    'range5p':range(6,11),
}
HERO_NAME = {
    'hero11': ['伐木机', '全能', '兽王', '圣教军', '大地', '大牛', '小小', '小牛', '山丘', '斯温', '熊猫', '船长'],
    'hero12': ['人马', '军团', '刚背', '发条', '大树', '沙王', '海民', '潮汐', '炼金', '瓦王', '神灵', '龙骑'],
    'hero13': ['DIABLO', '大屁股', '大鱼', '小狗', '狼人', '猛犸', '白牛', '精灵', '风骑士'],
    'hero14': ['saber', '噩梦骑士', '夜魔', '屠夫', '巫妖王', '斧王', '末日', '死骑', '混沌', '肉山', '骷髅王', '龙卵领主'],
    'hero21': ['剑圣', '娜迦', '敌法', '暗夜刺客', '暗夜哨兵', '月骑', '水人', '火枪', '白虎', '隐刺'],
    'hero22': ['vs', '圣堂', '小黑', '巨魔', '德鲁伊', '拍拍', '掠夺者', '火猫', '美杜莎', '虚空','猎魔人'],
    'hero23': ['剧毒', '小强', '小鱼', '幻刺', '猴子', '电棍', '虚灵猎手', '蜘蛛', '赏金', '骨弓'],
    'hero24': ['2B', 'TB', '地狱诗人', '幽鬼', '影魔', '机枪', '毒龙', '蚂蚁', '血魔', '远古飞蛇'],
    'hero31': ['先知', '冰女', '双头龙', '咏叹者', '圣骑士', '大天使', '天怒', '宙斯', '帕克', '火女', '狮鹫', '蓝猫'],
    'hero32': ['TK', '光法', '冰凤凰', '大魔导师', '小鹿', '沉默', '炸弹', '萨尔', '萨满', '蓝胖', '风行', '飞机'],
    'hero33': ['冰霜巨龙', '凤凰', '卡尔', '女王', '巫医', '戴泽', '死灵法', '老鹿', '莱恩', '蝙蝠', '谜团'],
    'hero34': ['DP', 'DS', '冰魂', '巫妖', '术士', '死灵飞龙', '毒狗', '痛苦之源', '骨法', '黑鸟'],
}
ALL_HEROES=['伐木机', '全能', '兽王', '圣教军', '大地', '大牛', '小小', '小牛', '山丘', '斯温', '熊猫', '船长', '人马', '军团', '刚背', '发条', '大树', '沙王', '海民', '潮汐', '炼金', '瓦王', '神灵', '龙骑', 'DIABLO', '大屁股', '大鱼', '小狗', '狼人', '猛犸', '白牛', '精灵', '风骑士', 'saber', '噩梦骑士', '夜魔', '屠夫', '巫妖王', '斧王', '末日', '死骑', '混沌', '肉山', '骷髅王', '龙卵领主', '剑圣', '娜迦', '敌法', '暗夜刺客', '暗夜哨兵', '月骑', '水人', '火枪', '白虎', '隐刺', 'vs', '圣堂', '小黑', '巨魔', '德鲁伊', '拍拍', '掠夺者', '火猫','猎魔人', '美杜莎', '虚空', '剧毒', '小强', '小鱼', '幻刺', '猴子', '电棍', '虚灵猎手', '蜘蛛', '赏金', '骨弓', '2B', 'TB', '地狱诗人', '幽鬼', '影魔', '机枪', '毒龙', '蚂蚁', '血魔', '远古飞蛇', '先知', '冰女', '双头龙', '咏叹者', '圣骑士', '大天使', '天怒', '宙斯', '帕克', '火女', '狮鹫', '蓝猫', 'TK', '光法', '冰凤凰', '大魔导师', '小鹿', '沉默', '炸弹', '萨尔', '萨满', '蓝胖', '风行', '飞机', '冰霜巨龙', '凤凰', '卡尔', '女王', '巫医', '戴泽', '死灵法', '老鹿', '莱恩', '蝙蝠', '谜团', 'DP', 'DS', '冰魂', '巫妖', '术士', '死灵飞龙', '毒狗', '痛苦之源', '骨法', '黑鸟']
